      ******************************************************************
      * Author:
      * Date: 2025/01/29
      * Purpose: TAKES N AMOUNT OF HISTORICAL QUOTE DATA FROM B3 AND
      *         MERGES THEM INTO ONE SINGULAR FILE
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. B3DTMERG.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM B3DTMERG.
